# Pandas

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Object Creation  创建对象

+ 创建Series

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

+ 创建DataFrame

In [5]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.650817 -0.662687  0.109123  0.030767
2013-01-02  2.948920 -0.423434 -1.180518  1.266356
2013-01-03  0.141886 -0.396507 -1.013370  1.773950
2013-01-04 -0.089682  1.285995 -0.488281  0.117347
2013-01-05  1.331303  0.424945  0.086777  0.820851
2013-01-06  0.087605 -0.000049  1.096744  2.689357

In [7]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

## Viewing Data 查看数据

In [8]:
 df.head() # 默认前五行

                   A         B         C         D
2013-01-01  1.650817 -0.662687  0.109123  0.030767
2013-01-02  2.948920 -0.423434 -1.180518  1.266356
2013-01-03  0.141886 -0.396507 -1.013370  1.773950
2013-01-04 -0.089682  1.285995 -0.488281  0.117347
2013-01-05  1.331303  0.424945  0.086777  0.820851

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.089682  1.285995 -0.488281  0.117347
2013-01-05  1.331303  0.424945  0.086777  0.820851
2013-01-06  0.087605 -0.000049  1.096744  2.689357

+ 查看行号，列号和值

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.values  #  the underlying numpy data

array([[-1.70376106,  0.40003297,  0.33894823,  0.63625203],
       [-0.57198075, -0.46391134, -1.68479105,  0.40957743],
       [ 0.84446794, -1.08002396, -0.49898156, -2.25236232],
       [-0.95301842, -0.83134824,  0.01314594, -1.68939207],
       [ 0.7443004 , -0.7072213 , -0.49359746,  1.05563778],
       [-0.02295129, -0.66943231,  1.27631708,  1.88642589]])

+ 快速统计

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   1.011808  0.038044 -0.231587  1.116438
std    1.190547  0.721297  0.843735  1.019128
min   -0.089682 -0.662687 -1.180518  0.030767
25%    0.101175 -0.416702 -0.882098  0.293223
50%    0.736594 -0.198278 -0.200752  1.043603
75%    1.570938  0.318697  0.103537  1.647052
max    2.948920  1.285995  1.096744  2.689357

+ 转置

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.650817    2.948920    0.141886   -0.089682    1.331303    0.087605
B   -0.662687   -0.423434   -0.396507    1.285995    0.424945   -0.000049
C    0.109123   -1.180518   -1.013370   -0.488281    0.086777    1.096744
D    0.030767    1.266356    1.773950    0.117347    0.820851    2.689357

+ 按坐标轴排序

In [14]:
df.sort_index(axis=0, ascending=False)    # ascending=False 降序

                   A         B         C         D
2013-01-06  0.087605 -0.000049  1.096744  2.689357
2013-01-05  1.331303  0.424945  0.086777  0.820851
2013-01-04 -0.089682  1.285995 -0.488281  0.117347
2013-01-03  0.141886 -0.396507 -1.013370  1.773950
2013-01-02  2.948920 -0.423434 -1.180518  1.266356
2013-01-01  1.650817 -0.662687  0.109123  0.030767

+ 按值排序

In [15]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2013-01-04 -0.089682  1.285995 -0.488281  0.117347
2013-01-05  1.331303  0.424945  0.086777  0.820851
2013-01-06  0.087605 -0.000049  1.096744  2.689357
2013-01-03  0.141886 -0.396507 -1.013370  1.773950
2013-01-02  2.948920 -0.423434 -1.180518  1.266356
2013-01-01  1.650817 -0.662687  0.109123  0.030767

## Selection 选择

###  Getting

选择一列，相当于一个Series

In [16]:
df['A']

2013-01-01    1.650817
2013-01-02    2.948920
2013-01-03    0.141886
2013-01-04   -0.089682
2013-01-05    1.331303
2013-01-06    0.087605
Freq: D, Name: A, dtype: float64

使用[]选择行（和list操作相似）

In [17]:
df[0:3]  #按行号选择行

                   A         B         C         D
2013-01-01  1.650817 -0.662687  0.109123  0.030767
2013-01-02  2.948920 -0.423434 -1.180518  1.266356
2013-01-03  0.141886 -0.396507 -1.013370  1.773950

In [18]:
df['20130102':'20130104'] #按索引选择行

                   A         B         C         D
2013-01-02  2.948920 -0.423434 -1.180518  1.266356
2013-01-03  0.141886 -0.396507 -1.013370  1.773950
2013-01-04 -0.089682  1.285995 -0.488281  0.117347

### Selection by Label 通过标签选择  [loc]

使用标签对表格数据进行行列自由切片

In [19]:
df.loc[dates[0]]  # 选择第一行

A    1.650817
B   -0.662687
C    0.109123
D    0.030767
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
 df.loc[:,['A','B']]  #选择两列

                   A         B
2013-01-01  1.650817 -0.662687
2013-01-02  2.948920 -0.423434
2013-01-03  0.141886 -0.396507
2013-01-04 -0.089682  1.285995
2013-01-05  1.331303  0.424945
2013-01-06  0.087605 -0.000049

In [21]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  2.948920 -0.423434
2013-01-03  0.141886 -0.396507
2013-01-04 -0.089682  1.285995

获取标量值

In [22]:
df.loc[dates[0],'A']    # 速度较慢

1.6508165824044534

In [37]:
df.at[dates[0],'A']     # 速度更快

-1.7037610557044627

### Selection by Position  按位置选择  [iloc]

In [41]:
df.iloc[3]    # 选取第四行

A   -0.953018
B   -0.831348
C    0.013146
D   -1.689392
Name: 2013-01-04 00:00:00, dtype: float64

In [42]:
df.iloc[3:5,0:2]    # [行，列]    # 重要

                   A         B
2013-01-04 -0.953018 -0.831348
2013-01-05  0.744300 -0.707221

In [43]:
df.iloc[[1,2,4],[0,2]]  # 行，列

                   A         C
2013-01-02 -0.571981 -1.684791
2013-01-03  0.844468 -0.498982
2013-01-05  0.744300 -0.493597

In [44]:
df.iloc[1:3,:]   # 列缺省

                   A         B         C         D
2013-01-02 -0.571981 -0.463911 -1.684791  0.409577
2013-01-03  0.844468 -1.080024 -0.498982 -2.252362

In [45]:
df.iloc[:,1:3] # 行缺省

                   B         C
2013-01-01  0.400033  0.338948
2013-01-02 -0.463911 -1.684791
2013-01-03 -1.080024 -0.498982
2013-01-04 -0.831348  0.013146
2013-01-05 -0.707221 -0.493597
2013-01-06 -0.669432  1.276317

In [24]:
df.iloc[1,1]  # 标量值，第二行第二列

-0.42343388254269759

In [48]:
df.iat[1,1]  # 更快获取标量值

-0.46391134227697428

### Boolean Indexing 布尔索引

使用单个列的值来选择数据

In [25]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.650817 -0.662687  0.109123  0.030767
2013-01-02  2.948920 -0.423434 -1.180518  1.266356
2013-01-03  0.141886 -0.396507 -1.013370  1.773950
2013-01-05  1.331303  0.424945  0.086777  0.820851
2013-01-06  0.087605 -0.000049  1.096744  2.689357

从满足条件的 DataFrame 中选择值

In [26]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.650817       NaN  0.109123  0.030767
2013-01-02  2.948920       NaN       NaN  1.266356
2013-01-03  0.141886       NaN       NaN  1.773950
2013-01-04       NaN  1.285995       NaN  0.117347
2013-01-05  1.331303  0.424945  0.086777  0.820851
2013-01-06  0.087605       NaN  1.096744  2.689357

使用 isin () 方法进行筛选:

In [28]:
 df2 = df.copy()

In [29]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  1.650817 -0.662687  0.109123  0.030767    one
2013-01-02  2.948920 -0.423434 -1.180518  1.266356    one
2013-01-03  0.141886 -0.396507 -1.013370  1.773950    two
2013-01-04 -0.089682  1.285995 -0.488281  0.117347  three
2013-01-05  1.331303  0.424945  0.086777  0.820851   four
2013-01-06  0.087605 -0.000049  1.096744  2.689357  three

In [30]:
df2[df2['E'].isin(['two','four'])]  # 通过选择表格中的标量值选取行，is in ...

                   A         B         C         D     E
2013-01-03  0.141886 -0.396507 -1.013370  1.773950   two
2013-01-05  1.331303  0.424945  0.086777  0.820851  four

### Setting  赋值

设置新列会自动按索引对齐数据

In [31]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [32]:
df['F'] = s1

按标签赋值

In [33]:
df.at[dates[0],'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.662687  0.109123  0.030767  NaN
2013-01-02  2.948920 -0.423434 -1.180518  1.266356  1.0
2013-01-03  0.141886 -0.396507 -1.013370  1.773950  2.0
2013-01-04 -0.089682  1.285995 -0.488281  0.117347  3.0
2013-01-05  1.331303  0.424945  0.086777  0.820851  4.0
2013-01-06  0.087605 -0.000049  1.096744  2.689357  5.0

按位置赋值

In [34]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.109123  0.030767  NaN
2013-01-02  2.948920 -0.423434 -1.180518  1.266356  1.0
2013-01-03  0.141886 -0.396507 -1.013370  1.773950  2.0
2013-01-04 -0.089682  1.285995 -0.488281  0.117347  3.0
2013-01-05  1.331303  0.424945  0.086777  0.820851  4.0
2013-01-06  0.087605 -0.000049  1.096744  2.689357  5.0

通过 numpy 数组赋值

In [35]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.109123  5  NaN
2013-01-02  2.948920 -0.423434 -1.180518  5  1.0
2013-01-03  0.141886 -0.396507 -1.013370  5  2.0
2013-01-04 -0.089682  1.285995 -0.488281  5  3.0
2013-01-05  1.331303  0.424945  0.086777  5  4.0
2013-01-06  0.087605 -0.000049  1.096744  5  5.0

In [36]:
df2 = df.copy()

In [37]:
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.109123 -5  NaN
2013-01-02 -2.948920 -0.423434 -1.180518 -5 -1.0
2013-01-03 -0.141886 -0.396507 -1.013370 -5 -2.0
2013-01-04 -0.089682 -1.285995 -0.488281 -5 -3.0
2013-01-05 -1.331303 -0.424945 -0.086777 -5 -4.0
2013-01-06 -0.087605 -0.000049 -1.096744 -5 -5.0

## Missing Data 缺失数据处理

pandas 使用np.nan 替代缺失值。默认情况下, 不参与运算。

reindex 用来更改/添加/删除指定坐标轴上的索引,返回的是副本。

In [38]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  0.109123  5  NaN NaN
2013-01-02  2.948920 -0.423434 -1.180518  5  1.0 NaN
2013-01-03  0.141886 -0.396507 -1.013370  5  2.0 NaN
2013-01-04 -0.089682  1.285995 -0.488281  5  3.0 NaN

In [39]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [40]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.109123  5  NaN  1.0
2013-01-02  2.948920 -0.423434 -1.180518  5  1.0  1.0
2013-01-03  0.141886 -0.396507 -1.013370  5  2.0  NaN
2013-01-04 -0.089682  1.285995 -0.488281  5  3.0  NaN

删除所有丢失数据的行

In [42]:
df1.dropna(how='any')

                  A         B         C  D    F    E
2013-01-02  2.94892 -0.423434 -1.180518  5  1.0  1.0

填充缺失数据

In [85]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.338948  5  5.0  1.0
2013-01-02 -0.571981 -0.463911 -1.684791  5  1.0  1.0
2013-01-03  0.844468 -1.080024 -0.498982  5  2.0  5.0
2013-01-04 -0.953018 -0.831348  0.013146  5  3.0  5.0

获取值为 nan 的布尔值

In [89]:
pd.isnull(df1)   # 此处官网手册有误（旧版？），原为isna

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

### Stats

操作一般排除丢失的数据

执行描述性统计

In [97]:
df.mean()  # 列平均

A    0.006803
B   -0.625323
C   -0.174826
D    5.000000
F    3.000000
dtype: float64

In [96]:
df.mean(1)   # 行平均

2013-01-01    1.334737
2013-01-02    0.655863
2013-01-03    1.253092
2013-01-04    1.245756
2013-01-05    1.708696
2013-01-06    2.116787
Freq: D, dtype: float64

使用具有不同维度且需要对齐的对象进行操作

In [105]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)    # shift对齐，参数 代表从第一位开始对齐，其余为nan
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [106]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.155532 -2.080024 -1.498982  4.0  1.0
2013-01-04 -3.953018 -3.831348 -2.986854  2.0  0.0
2013-01-05 -4.255700 -5.707221 -5.493597  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

###  Apply

将函数应用于数据

In [110]:
df.apply(np.cumsum)   # 累加

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.338948   5   NaN
2013-01-02 -0.571981 -0.463911 -1.345843  10   1.0
2013-01-03  0.272487 -1.543935 -1.844824  15   3.0
2013-01-04 -0.680531 -2.375284 -1.831678  20   6.0
2013-01-05  0.063769 -3.082505 -2.325276  25  10.0
2013-01-06  0.040818 -3.751937 -1.048959  30  15.0

In [116]:
df.apply(lambda x: x.max() - x.min())

A    1.797486
B    1.080024
C    2.961108
D    0.000000
F    4.000000
dtype: float64

### Histogramming

值分布统计（计数）

In [121]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    0
1    5
2    0
3    3
4    6
5    0
6    0
7    1
8    0
9    6
dtype: int32

In [122]:
s.value_counts()

0    5
6    2
5    1
3    1
1    1
dtype: int64

### String Methods

In [125]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [126]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge 合并

### Concat

pandas 提供了连接，合并类型用以series,dataframe,pandel对象的索引和逻辑关系操作

concat 用来连接pandas对象

In [127]:
 df = pd.DataFrame(np.random.randn(10, 4))

In [128]:
df

          0         1         2         3
0  0.628242  1.569747  0.064640  0.550101
1 -0.609205 -0.050554  0.951079  1.385626
2  0.338788  0.184727  0.014303 -0.240246
3 -0.062379  0.975794  0.884984 -0.962791
4 -0.103745 -1.028678 -0.097951 -0.923498
5  0.409717  0.551187 -1.535476  1.384188
6 -1.274227 -0.228926 -0.994856 -1.159868
7  1.289336  0.286643  0.733815  0.066349
8  0.784257 -1.410437  0.366802  0.878327
9  1.736793  0.342095 -0.847584  0.292843

In [130]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.628242  1.569747  0.064640  0.550101
 1 -0.609205 -0.050554  0.951079  1.385626
 2  0.338788  0.184727  0.014303 -0.240246,
           0         1         2         3
 3 -0.062379  0.975794  0.884984 -0.962791
 4 -0.103745 -1.028678 -0.097951 -0.923498
 5  0.409717  0.551187 -1.535476  1.384188
 6 -1.274227 -0.228926 -0.994856 -1.159868,
           0         1         2         3
 7  1.289336  0.286643  0.733815  0.066349
 8  0.784257 -1.410437  0.366802  0.878327
 9  1.736793  0.342095 -0.847584  0.292843]

In [131]:
pd.concat(pieces)

          0         1         2         3
0  0.628242  1.569747  0.064640  0.550101
1 -0.609205 -0.050554  0.951079  1.385626
2  0.338788  0.184727  0.014303 -0.240246
3 -0.062379  0.975794  0.884984 -0.962791
4 -0.103745 -1.028678 -0.097951 -0.923498
5  0.409717  0.551187 -1.535476  1.384188
6 -1.274227 -0.228926 -0.994856 -1.159868
7  1.289336  0.286643  0.733815  0.066349
8  0.784257 -1.410437  0.366802  0.878327
9  1.736793  0.342095 -0.847584  0.292843

### Join

SQL 样式合并

In [133]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [134]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [135]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [140]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [141]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [142]:
 pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append 追加

追加行

In [143]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0 -0.557131  0.227686 -0.805009 -0.136803
1 -0.041657 -1.392116  0.913373  0.656512
2  0.918080  2.214438 -0.222283  0.894100
3  0.958492 -0.965575 -1.057388 -1.629425
4 -0.982000 -1.281867 -0.127079 -1.457692
5  0.867965 -0.694595  0.391518  0.413965
6  1.030395  2.588813  0.988887  1.132224
7 -1.124320  1.840328 -0.753186  0.679801

In [145]:
s = df.iloc[3]
s

A    0.958492
B   -0.965575
C   -1.057388
D   -1.629425
Name: 3, dtype: float64

In [146]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.557131  0.227686 -0.805009 -0.136803
1 -0.041657 -1.392116  0.913373  0.656512
2  0.918080  2.214438 -0.222283  0.894100
3  0.958492 -0.965575 -1.057388 -1.629425
4 -0.982000 -1.281867 -0.127079 -1.457692
5  0.867965 -0.694595  0.391518  0.413965
6  1.030395  2.588813  0.988887  1.132224
7 -1.124320  1.840328 -0.753186  0.679801
8  0.958492 -0.965575 -1.057388 -1.629425

## Grouping 分组

+ 分组涉及以下几步：
    + 根据某些条件将数据拆分为组
    + 分别对每个组应用函数
    + 将结果合并到数据结构中

In [148]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.521962 -1.603683
1  bar    one -0.900464 -0.203764
2  foo    two  0.534517  0.721476
3  bar  three  0.582279 -2.306651
4  foo    two -0.127729  0.339230
5  bar    two -1.029637  1.275973
6  foo    one  1.767223 -1.730170
7  foo  three -1.434532  1.150071

分组, 然后对其应用求和函数

In [149]:
df.groupby('A').sum()

            C         D
A
bar -1.347822 -1.234442
foo  0.217517 -1.123076

按多个列分组形成一个分层索引, 然后应用函数

In [151]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.900464 -0.203764
    three  0.582279 -2.306651
    two   -1.029637  1.275973
foo one    1.245262 -3.333853
    three -1.434532  1.150071
    two    0.406788  1.060706

## Reshaping 变形

### Stack

In [152]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [155]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [157]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one     0.355154  0.962615
      two     1.129863 -1.509192
baz   one     0.020797  0.272386
      two     0.875854 -0.682798
foo   one    -1.039935  0.016412
      two    -1.435218 -0.609950
qux   one    -0.583655  1.597483
      two     0.205564 -0.976733

In [159]:
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.355154  0.962615
      two     1.129863 -1.509192
baz   one     0.020797  0.272386
      two     0.875854 -0.682798

The stack() method “compresses” a level in the DataFrame’s columns.

In [173]:
stacked = df2.stack() # 把A,B列压为一列
stacked

first  second
bar    one     A    0.355154
               B    0.962615
       two     A    1.129863
               B   -1.509192
baz    one     A    0.020797
               B    0.272386
       two     A    0.875854
               B   -0.682798
dtype: float64

With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the last level:

In [174]:
stacked.unstack()

                     A         B
first second
bar   one     0.355154  0.962615
      two     1.129863 -1.509192
baz   one     0.020797  0.272386
      two     0.875854 -0.682798

In [175]:
stacked.unstack(1)

second        one       two
first
bar   A  0.355154  1.129863
      B  0.962615 -1.509192
baz   A  0.020797  0.875854
      B  0.272386 -0.682798

In [176]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.355154  0.020797
       B  0.962615  0.272386
two    A  1.129863  0.875854
       B -1.509192 -0.682798

### Pivot Tables

In [178]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
   .....:                    'B' : ['A', 'B', 'C'] * 4,
   .....:                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
   .....:                    'D' : np.random.randn(12),
   .....:                    'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -1.130818 -0.554487
1     one  B  foo -1.748368  0.021136
2     two  C  foo  1.576644 -0.646204
3   three  A  bar -1.400652 -1.159767
4     one  B  bar  2.290299 -0.282736
5     one  C  bar -1.751329  0.193770
6     two  A  foo  0.389543 -1.128069
7   three  B  foo  0.760359 -0.097108
8     one  C  foo  1.674691 -0.901078
9     one  A  bar -0.322313  1.060932
10    two  B  bar -0.133810  0.677192
11  three  C  bar -0.009250 -2.496114

生成透视表

In [180]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.322313 -1.130818
      B  2.290299 -1.748368
      C -1.751329  1.674691
three A -1.400652       NaN
      B       NaN  0.760359
      C -0.009250       NaN
two   A       NaN  0.389543
      B -0.133810       NaN
      C       NaN  1.576644

## Time Series 时间序列

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion
(e.g., converting secondly data into 5-minutely data). 
This is extremely common in, but not limited to, financial applications. See the Time Series section

In [186]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [189]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [190]:
ts.resample('5Min').sum()

2012-01-01    22741
Freq: 5T, dtype: int32

时区表示

In [192]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [195]:
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    1.120546
2012-03-07   -0.123521
2012-03-08    2.216332
2012-03-09    1.459491
2012-03-10    0.895227
Freq: D, dtype: float64

In [198]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00    1.120546
2012-03-07 00:00:00+00:00   -0.123521
2012-03-08 00:00:00+00:00    2.216332
2012-03-09 00:00:00+00:00    1.459491
2012-03-10 00:00:00+00:00    0.895227
Freq: D, dtype: float64

转换为其他时区

In [199]:
 ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    1.120546
2012-03-06 19:00:00-05:00   -0.123521
2012-03-07 19:00:00-05:00    2.216332
2012-03-08 19:00:00-05:00    1.459491
2012-03-09 19:00:00-05:00    0.895227
Freq: D, dtype: float64

在时间跨度表示之间转换

In [202]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31    1.163284
2012-02-29    0.319091
2012-03-31   -0.657649
2012-04-30    0.815593
2012-05-31    1.143020
Freq: M, dtype: float64

In [204]:
ps = ts.to_period()
ps

2012-01    1.163284
2012-02    0.319091
2012-03   -0.657649
2012-04    0.815593
2012-05    1.143020
Freq: M, dtype: float64

In [205]:
ps.to_timestamp()

2012-01-01    1.163284
2012-02-01    0.319091
2012-03-01   -0.657649
2012-04-01    0.815593
2012-05-01    1.143020
Freq: MS, dtype: float64

在周期和时间戳之间转换可以使用算术函数。在下面的示例中, 将季度频率与季度结束后的11月到9am 之间的年份进行转换:

In [206]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

1990-03-01 09:00    1.015710
1990-06-01 09:00   -1.264352
1990-09-01 09:00   -0.640373
1990-12-01 09:00   -0.945372
1991-03-01 09:00   -0.170761
Freq: H, dtype: float64

## Categoricals 分类对象

pandas 可以在DataFrame中包含分类数据

In [207]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

将原始分数转换为分类数据类型

In [208]:
df["grade"] = df["raw_grade"].astype("category")

In [209]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

重命名分类数据使其更有意义

In [212]:
df["grade"].cat.categories = ["very good", "good", "very bad"]
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

重新排序类别并同时添加缺少的类别

In [213]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [216]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

分类是按顺序排序, 而不是词法顺序

In [218]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

按分类列分组也显示空类别

In [219]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

## Plotting 绘图

略

## Getting Data In/Out 数据读写

### CSV

In [221]:
df.to_csv('foo.csv')

In [222]:
pd.read_csv('foo.csv')

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad

### HDF5

In [225]:
df2.to_hdf('foo.h5','df')

In [226]:
pd.read_hdf('foo.h5','df')

                     A         B
first second
bar   one     0.355154  0.962615
      two     1.129863 -1.509192
baz   one     0.020797  0.272386
      two     0.875854 -0.682798

### Excel

In [227]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

In [228]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

## Gotchas  陷阱